Revit 2027 API
DimensionType.GetUnitsFormatOptions Method
 Gets the FormatOptions to optionally override the default settings in the Units class for the units value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FormatOptions GetUnitsFormatOptions()
Public Function GetUnitsFormatOptions As FormatOptions
public:
FormatOptions^ GetUnitsFormatOptions()
member GetUnitsFormatOptions : unit -> FormatOptions
Return Value
FormatOptions
 A copy of the FormatOptions.
See Also
Reference
DimensionType Class
Autodesk.Revit.DB Namespace